///№1 обьект Курс представляет собой учебный курс на который можно зарегистрировать студентов
///№2 учебный курс характеризуют следующие данные: название курса, количество студентов, максимальное количество студентов, количество учебных часов
///#3 с объектом курс можно выполнять следующие действия: добавить студента — addStudent();
/// удалить студента — removeStudent(); изменить количество часов — changeHours(); проверить, заполнен ли курс — isFull(); вывести информацию о курсе — print().
///№4 недопустимым является состояние при котором количество зарегистрированных студентов превышает максимальное количество